MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_exti.h
/**
  *********************************************************************************************************************
  * @file    stm32c5xx_ll_exti.h
  * @brief   Header file of EXTI LL module.
  *********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************
  */

/* Define to prevent recursive inclusion ----------------------------------------------------------------------------*/
#ifndef  STM32C5XX_LL_EXTI_H
#define  STM32C5XX_LL_EXTI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ---------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined (EXTI)

/** @defgroup EXTI_LL EXTI
  * @{
  */

/* Private types ----------------------------------------------------------------------------------------------------*/
/* Private variables ------------------------------------------------------------------------------------------------*/
/* Private constants ------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_Private_Constants EXTI Private Constants
  * @{
  */
/**
  * @brief  EXTI Register Pin Position Shift.
  */
#define LL_EXTI_REGISTER_PINPOS_SHFT        16U   /*!< Definition used to shift the pin position in the EXTICR register */

/**
  * @brief  EXTI Line property definition.
  */
#define LL_EXTI_PROPERTY_SHIFT              24U
#define LL_EXTI_DIRECT                      (0x01UL << LL_EXTI_PROPERTY_SHIFT)
#define LL_EXTI_CONFIG                      (0x02UL << LL_EXTI_PROPERTY_SHIFT)
#define LL_EXTI_GPIO                        ((0x04UL << LL_EXTI_PROPERTY_SHIFT) | LL_EXTI_CONFIG)
#define LL_EXTI_RESERVED                    (0x08UL << LL_EXTI_PROPERTY_SHIFT)
#define LL_EXTI_PROPERTY_MASK               (LL_EXTI_DIRECT | LL_EXTI_CONFIG | LL_EXTI_GPIO)

/**
  * @brief  EXTI Source register number.
  */
#define LL_EXTI_CR_REGISTER_SHIFT           8U
#define LL_EXTI_CR1                         (0x00U << LL_EXTI_CR_REGISTER_SHIFT)
#define LL_EXTI_CR2                         (0x01UL << LL_EXTI_CR_REGISTER_SHIFT)
#define LL_EXTI_CR3                         (0x02UL << LL_EXTI_CR_REGISTER_SHIFT)
#define LL_EXTI_CR4                         (0x03UL << LL_EXTI_CR_REGISTER_SHIFT)

/**
  * @brief  EXTI Register and bit usage.
  */
#define LL_EXTI_REG_SHIFT                   16U
#define LL_EXTI_REG1                        (0x01UL << LL_EXTI_REG_SHIFT)
#define LL_EXTI_REG2                        (0x02UL << LL_EXTI_REG_SHIFT)
#define LL_EXTI_REG_MASK                    (LL_EXTI_REG1 | LL_EXTI_REG2)
#define LL_EXTI_PIN_MASK                    0x0000001FU

/**
  * @brief  EXTI Line number.
  */
#if defined(EXTI_IMR2_IM43)
#define LL_EXTI_LINE_NB                     44U
#else
#if defined(EXTI_IMR2_EM37)
#define LL_EXTI_LINE_NB                     39U
#elif defined(EXTI_IMR2_EM36)
#define LL_EXTI_LINE_NB                     37U
#else
#define LL_EXTI_LINE_NB                     36U
#endif /* defined(EXTI_IMR2_EM37) */
#endif /* defined(EXTI_IMR2_IM43) */
/**
  * @}
  */
/* Private Macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_Private_Macros EXTI Private Macros
  * @{
  */
/**
  * @}
  */

/* Exported types ---------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_ES_INIT LL EXTI Init structure
  * @{
  */
/**
  * @}
  */

/* Exported constants -----------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Constants LL EXTI Constants
  * @{
  */

/** @defgroup EXTI_LL_EC_LINE LINE
  * @{
  */
#define LL_EXTI_LINE_0                EXTI_IMR1_IM0           /*!< Extended line 0 */
#define LL_EXTI_LINE_1                EXTI_IMR1_IM1           /*!< Extended line 1 */
#define LL_EXTI_LINE_2                EXTI_IMR1_IM2           /*!< Extended line 2 */
#define LL_EXTI_LINE_3                EXTI_IMR1_IM3           /*!< Extended line 3 */
#define LL_EXTI_LINE_4                EXTI_IMR1_IM4           /*!< Extended line 4 */
#define LL_EXTI_LINE_5                EXTI_IMR1_IM5           /*!< Extended line 5 */
#define LL_EXTI_LINE_6                EXTI_IMR1_IM6           /*!< Extended line 6 */
#define LL_EXTI_LINE_7                EXTI_IMR1_IM7           /*!< Extended line 7 */
#define LL_EXTI_LINE_8                EXTI_IMR1_IM8           /*!< Extended line 8 */
#define LL_EXTI_LINE_9                EXTI_IMR1_IM9           /*!< Extended line 9 */
#define LL_EXTI_LINE_10               EXTI_IMR1_IM10          /*!< Extended line 10 */
#define LL_EXTI_LINE_11               EXTI_IMR1_IM11          /*!< Extended line 11 */
#define LL_EXTI_LINE_12               EXTI_IMR1_IM12          /*!< Extended line 12 */
#define LL_EXTI_LINE_13               EXTI_IMR1_IM13          /*!< Extended line 13 */
#define LL_EXTI_LINE_14               EXTI_IMR1_IM14          /*!< Extended line 14 */
#define LL_EXTI_LINE_15               EXTI_IMR1_IM15          /*!< Extended line 15 */
#define LL_EXTI_LINE_16               EXTI_IMR1_IM16          /*!< Extended line 16 */
#define LL_EXTI_LINE_17               EXTI_IMR1_IM17          /*!< Extended line 17 */
#define LL_EXTI_LINE_18               EXTI_IMR1_IM18          /*!< Extended line 18 */
#define LL_EXTI_LINE_19               EXTI_IMR1_IM19          /*!< Extended line 19 */
#define LL_EXTI_LINE_20               EXTI_IMR1_IM20          /*!< Extended line 20 */
#define LL_EXTI_LINE_21               EXTI_IMR1_IM21          /*!< Extended line 21 */
#define LL_EXTI_LINE_22               EXTI_IMR1_IM22          /*!< Extended line 22 */
#define LL_EXTI_LINE_23               EXTI_IMR1_IM23          /*!< Extended line 23 */
#define LL_EXTI_LINE_24               EXTI_IMR1_IM24          /*!< Extended line 24 */
#define LL_EXTI_LINE_25               EXTI_IMR1_IM25          /*!< Extended line 25 */
#define LL_EXTI_LINE_26               EXTI_IMR1_IM26          /*!< Extended line 26 */
#define LL_EXTI_LINE_27               EXTI_IMR1_IM27          /*!< Extended line 27 */
#define LL_EXTI_LINE_28               EXTI_IMR1_IM28          /*!< Extended line 28 */
#define LL_EXTI_LINE_29               EXTI_IMR1_IM29          /*!< Extended line 29 */
#define LL_EXTI_LINE_30               EXTI_IMR1_IM30          /*!< Extended line 30 */
#define LL_EXTI_LINE_31               EXTI_IMR1_IM31          /*!< Extended line 31 */
#define LL_EXTI_LINE_ALL_0_31         0xFFFFFFFFU             /*!< All extended lines */

#define LL_EXTI_LINE_32               EXTI_IMR2_IM32          /*!< Extended line 32 */
#define LL_EXTI_LINE_33               EXTI_IMR2_IM33          /*!< Extended line 33 */
#define LL_EXTI_LINE_34               EXTI_IMR2_IM34          /*!< Extended line 34 */
#define LL_EXTI_LINE_35               EXTI_IMR2_IM35          /*!< Extended line 35 */
#if defined(EXTI_IMR2_IM36)
#define LL_EXTI_LINE_36               EXTI_IMR2_IM36          /*!< Extended line 36 */
#endif /* EXTI_IMR2_IM36 */
#if defined(EXTI_IMR2_IM37)
#define LL_EXTI_LINE_37               EXTI_IMR2_IM37          /*!< Extended line 37 */
#endif /* EXTI_IMR2_IM37 */
#if defined(EXTI_IMR2_IM38)
#define LL_EXTI_LINE_38               EXTI_IMR2_IM38          /*!< Extended line 38 */
#endif /* EXTI_IMR2_IM38 */
#if defined(EXTI_IMR2_IM39)
#define LL_EXTI_LINE_39               EXTI_IMR2_IM39          /*!< Extended line 39 */
#endif /* EXTI_IMR2_IM39 */
#if defined(EXTI_IMR2_IM41)
#define LL_EXTI_LINE_41               EXTI_IMR2_IM41          /*!< Extended line 41 */
#endif /* EXTI_IMR2_IM41 */
#if defined(EXTI_IMR2_IM42)
#define LL_EXTI_LINE_42               EXTI_IMR2_IM42          /*!< Extended line 42 */
#endif /* EXTI_IMR2_IM42 */
#if defined(EXTI_IMR2_IM43)
#define LL_EXTI_LINE_43               EXTI_IMR2_IM43          /*!< Extended line 43 */
#endif /* EXTI_IMR2_IM43 */
#if defined(EXTI_IMR2_IM43)
#define LL_EXTI_LINE_ALL_32_63        0x00000FFFU             /*!< All extended lines */
#else
#if defined(EXTI_IMR2_IM37)
#define LL_EXTI_LINE_ALL_32_63        0x000000EFU             /*!< All extended lines */
#elif defined(EXTI_IMR2_IM36)
#define LL_EXTI_LINE_ALL_32_63        0x0000001FU             /*!< All extended lines */
#else
#define LL_EXTI_LINE_ALL_32_63        0x0000000FU             /*!< All extended lines */
#endif /* EXTI_IMR2_IM37 */
#endif /* EXTI_IMR2_IM43 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_PORT EXTI EXTI PORT
  * @{
  */
#define LL_EXTI_GPIO_PORTA         0U                                                               /*!< EXTI PORT A */
#define LL_EXTI_GPIO_PORTB         EXTI_EXTICR1_EXTI0_0                                             /*!< EXTI PORT B */
#define LL_EXTI_GPIO_PORTC         EXTI_EXTICR1_EXTI0_1                                             /*!< EXTI PORT C */
#define LL_EXTI_GPIO_PORTD         (EXTI_EXTICR1_EXTI0_1 | EXTI_EXTICR1_EXTI0_0)                        /*!< EXTI PORT D */
#define LL_EXTI_GPIO_PORTE         EXTI_EXTICR1_EXTI0_2                                                 /*!< EXTI PORT E */
#if defined(GPIOF)
#define LL_EXTI_GPIO_PORTF         (EXTI_EXTICR1_EXTI0_2 | EXTI_EXTICR1_EXTI0_0)                        /*!< EXTI PORT F */
#endif /* GPIOF */
#if defined(GPIOG)
#define LL_EXTI_GPIO_PORTG         (EXTI_EXTICR1_EXTI0_2 | EXTI_EXTICR1_EXTI0_1)                        /*!< EXTI PORT G */
#endif /* GPIOG */
#define LL_EXTI_GPIO_PORTH         (EXTI_EXTICR1_EXTI0_2 | EXTI_EXTICR1_EXTI0_1 | EXTI_EXTICR1_EXTI0_0) /*!< EXTI PORT H */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_LINE EXTI EXTI LINE
  * @{
  */
#define LL_EXTI_GPIO_LINE0               (LL_EXTI_CR1 | 0x00U)  /*!< EXTI GPIO Line 0 */
#define LL_EXTI_GPIO_LINE1               (LL_EXTI_CR1 | 0x01U)  /*!< EXTI GPIO Line 1 */
#define LL_EXTI_GPIO_LINE2               (LL_EXTI_CR1 | 0x02U)  /*!< EXTI GPIO Line 2 */
#define LL_EXTI_GPIO_LINE3               (LL_EXTI_CR1 | 0x03U)  /*!< EXTI GPIO Line 3 */
#define LL_EXTI_GPIO_LINE4               (LL_EXTI_CR2 | 0x04U)  /*!< EXTI GPIO Line 4 */
#define LL_EXTI_GPIO_LINE5               (LL_EXTI_CR2 | 0x05U)  /*!< EXTI GPIO Line 5 */
#define LL_EXTI_GPIO_LINE6               (LL_EXTI_CR2 | 0x06U)  /*!< EXTI GPIO Line 6 */
#define LL_EXTI_GPIO_LINE7               (LL_EXTI_CR2 | 0x07U)  /*!< EXTI GPIO Line 7 */
#define LL_EXTI_GPIO_LINE8               (LL_EXTI_CR3 | 0x08U)  /*!< EXTI GPIO Line 8 */
#define LL_EXTI_GPIO_LINE9               (LL_EXTI_CR3 | 0x09U)  /*!< EXTI GPIO Line 9 */
#define LL_EXTI_GPIO_LINE10              (LL_EXTI_CR3 | 0x0AU)  /*!< EXTI GPIO Line 10 */
#define LL_EXTI_GPIO_LINE11              (LL_EXTI_CR3 | 0x0BU)  /*!< EXTI GPIO Line 11 */
#define LL_EXTI_GPIO_LINE12              (LL_EXTI_CR4 | 0x0CU)  /*!< EXTI GPIO Line 12 */
#define LL_EXTI_GPIO_LINE13              (LL_EXTI_CR4 | 0x0DU)  /*!< EXTI GPIO Line 13 */
#define LL_EXTI_GPIO_LINE14              (LL_EXTI_CR4 | 0x0EU)  /*!< EXTI GPIO Line 14 */
#define LL_EXTI_GPIO_LINE15              (LL_EXTI_CR4 | 0x0FU)  /*!< EXTI GPIO Line 15 */
/**
  * @}
  */

/** @defgroup EXTI_LL_EC_ATTRIBUTES Attributes Defines
  * @{
  */
#define LL_EXTI_ATTR_NPRIV       0U                /*!< Non-Privileged attribute */
#define LL_EXTI_ATTR_PRIV        1U                /*!< Privileged attribute */
/**
  * @}
  */

