MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_exti.h
/** @defgroup EXTI_LL_EC_MODE Mode
  * @{
  */
#define LL_EXTI_MODE_IT                 ((uint8_t)0x01U) /*!< Interrupt Mode */
#define LL_EXTI_MODE_EVENT              ((uint8_t)0x02U) /*!< Event Mode */
#define LL_EXTI_MODE_IT_EVENT           ((uint8_t)0x03U) /*!< Interrupt & Event Mode */
/**
  * @}
  */

/** @defgroup EXTI_LL_EC_TRIGGER Edge Trigger
  * @{
  */
#define LL_EXTI_TRIGGER_NONE            ((uint8_t)0x00U) /*!< No Trigger Mode */
#define LL_EXTI_TRIGGER_RISING          ((uint8_t)0x01U) /*!< Trigger Rising Mode */
#define LL_EXTI_TRIGGER_FALLING         ((uint8_t)0x02U) /*!< Trigger Falling Mode */
#define LL_EXTI_TRIGGER_RISING_FALLING  ((uint8_t)0x03U) /*!< Trigger Rising & Falling Mode */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Macros LL EXTI Macros
  * @{
  */

/** @defgroup EXTI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in EXTI register.
  * @param reg Register to be written.
  * @param value Value to be written in the register.
  */
#define LL_EXTI_WRITE_REG(reg, value) STM32_WRITE_REG(EXTI->reg, (value))

/**
  * @brief  Read a value in EXTI register.
  * @param reg Register to be read.
  * @retval Register value
  */
#define LL_EXTI_READ_REG(reg) STM32_READ_REG(EXTI->reg)
/**
  * @}
  */


/**
  * @}
  */


/* Exported functions -----------------------------------------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Functions LL EXTI Functions
  * @{
  */
/** @defgroup EXTI_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable EXTI Line Interrupt request for Lines in range 0 to 31.
  * @rmtoll
  *  IMR1         IMx           LL_EXTI_EnableIT_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  *         @arg @ref LL_EXTI_LINE_ALL_0_31
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableIT_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->IMR1, exti_line);
}

/**
  * @brief  Enable EXTI Line Interrupt request for Lines in range 32 to 63.
  * @rmtoll
  *  IMR2         IMx           LL_EXTI_EnableIT_32_63
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  *         @arg @ref LL_EXTI_LINE_ALL_32_63
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableIT_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->IMR2, exti_line);
}

/**
  * @brief  Disable EXTI Line Interrupt request for Lines in range 0 to 31.
  * @rmtoll
  *  IMR1         IMx           LL_EXTI_DisableIT_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  *         @arg @ref LL_EXTI_LINE_ALL_0_31
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableIT_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->IMR1, exti_line);
}

/**
  * @brief  Disable EXTI Line Interrupt request for Lines in range 32 to 63.
  * @rmtoll
  *  IMR2         IMx           LL_EXTI_DisableIT_32_63
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  *         @arg @ref LL_EXTI_LINE_ALL_32_63
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableIT_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->IMR2, exti_line);
}

/**
  * @brief  Indicate if EXTI Line Interrupt request is enabled for Lines in range 0 to 31.
  * @rmtoll
  *  IMR1         IMx           LL_EXTI_IsEnabledIT_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->IMR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if EXTI Line Interrupt request is enabled for Lines in range 32 to 63.
  * @rmtoll
  *  IMR2         IMx           LL_EXTI_IsEnabledIT_32_63
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  * @note The reset value for the direct or internal lines (see RM)
  *       is set to 1 in order to enable the interrupt by default.
  *       Bits are set automatically at power-on.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->IMR2, exti_line) == (exti_line)) ? 1U : 0U);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Event_Management Event_Management
  * @{
  */

/**
  * @brief  Enable EXTI Line Event request for Lines in range 0 to 31.
  * @rmtoll
  *  EMR1         EMx           LL_EXTI_EnableEvent_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  *         @arg @ref LL_EXTI_LINE_ALL_0_31
  * @note   (*)Please check each device line mapping for EXTI Line availability
  */
__STATIC_INLINE void LL_EXTI_EnableEvent_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->EMR1, exti_line);
}

/**
  * @brief  Enable EXTI Line Event request for Lines in range 32 to 63.
  * @rmtoll
  *  EMR2         EMx           LL_EXTI_EnableEvent_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  *         @arg @ref LL_EXTI_LINE_ALL_32_63
  * @note   (*)Please check each device line mapping for EXTI Line availability
  */
__STATIC_INLINE void LL_EXTI_EnableEvent_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->EMR2, exti_line);
}

/**
  * @brief  Disable EXTI Line Event request for Lines in range 0 to 31.
  * @rmtoll
  *  EMR1         EMx           LL_EXTI_DisableEvent_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  *         @arg @ref LL_EXTI_LINE_ALL_0_31
  * @note   (*)Please check each device line mapping for EXTI Line availability
  */
__STATIC_INLINE void LL_EXTI_DisableEvent_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->EMR1, exti_line);
}

/**
  * @brief  Disable EXTI Line Event request for Lines in range 32 to 63.
  * @rmtoll
  *  EMR2         EMx           LL_EXTI_DisableEvent_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  *         @arg @ref LL_EXTI_LINE_ALL_32_63
  * @note   (*)Please check each device line mapping for EXTI Line availability
  */
__STATIC_INLINE void LL_EXTI_DisableEvent_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->EMR2, exti_line);
}

/**
  * @brief  Indicate if EXTI Line Event request is enabled for Lines in range 0 to 31.
  * @rmtoll
  *  EMR1         EMx           LL_EXTI_IsEnabledEvent_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  * @note   (*)Please check each device line mapping for EXTI Line availability
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledEvent_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->EMR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if EXTI Line Event request is enabled for Lines in range 32 to 63.
  * @rmtoll
  *  EMR2         EMx           LL_EXTI_IsEnabledEvent_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  * @note   (*)Please check each device line mapping for EXTI Line availability
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledEvent_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->EMR2, exti_line) == (exti_line)) ? 1U : 0U);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Rising_Trigger_Management Rising_Trigger_Management
  * @{
  */

/**
  * @brief  Enable EXTI Line Rising Edge Trigger for Lines in range 0 to 31.
  * @rmtoll
  *  RTSR1        RTx           LL_EXTI_EnableRisingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a rising edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_RTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->RTSR1, exti_line);
}

/**
  * @brief  Enable EXTI Line Rising Edge Trigger for Lines in range 32 to 63.
  * @rmtoll
  *  RTSR2        RTx           LL_EXTI_EnableRisingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a rising edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_RTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->RTSR2, exti_line);
}

