MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_exti.h
/**
  * @brief  Disable EXTI Line Rising Edge Trigger for Lines in range 0 to 31.
  * @rmtoll
  *  RTSR1        RTx           LL_EXTI_DisableRisingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a rising edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_RTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->RTSR1, exti_line);
}

/**
  * @brief  Disable EXTI Line Rising Edge Trigger for Lines in range 32 to 63.
  * @rmtoll
  *  RTSR2        RTx           LL_EXTI_DisableRisingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a rising edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_RTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->RTSR2, exti_line);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range 0 to 31.
  * @rmtoll
  *  RTSR1        RTx           LL_EXTI_IsEnabledRisingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->RTSR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range 32 to 63.
  * @rmtoll
  *  RTSR2        RTx           LL_EXTI_IsEnabledRisingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->RTSR2, exti_line) == (exti_line)) ? 1U : 0U);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Falling_Trigger_Management Falling_Trigger_Management
  * @{
  */

/**
  * @brief  Enable EXTI Line Falling Edge Trigger for Lines in range 0 to 31.
  * @rmtoll
  *  FTSR1        FTx           LL_EXTI_EnableFallingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a falling edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_FTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableFallingTrig_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->FTSR1, exti_line);
}

/**
  * @brief  Enable EXTI Line Falling Edge Trigger for Lines in range 32 to 63.
  * @rmtoll
  *  FTSR2        FTx           LL_EXTI_EnableFallingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a falling edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_FTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_EnableFallingTrig_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->FTSR2, exti_line);
}

/**
  * @brief  Disable EXTI Line Falling Edge Trigger for Lines in range 0 to 31.
  * @rmtoll
  *  FTSR1        FTx           LL_EXTI_DisableFallingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a falling edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_FTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableFallingTrig_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->FTSR1, exti_line);
}

/**
  * @brief  Disable EXTI Line Falling Edge Trigger for Lines in range 32 to 63.
  * @rmtoll
  *  FTSR2        FTx           LL_EXTI_DisableFallingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note The configurable wakeup lines are edge-triggered. No glitch must be generated on these lines.
  *         If a falling edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_FTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_DisableFallingTrig_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_CLEAR_BIT_32(EXTI->FTSR2, exti_line);
}

/**
  * @brief  Check if falling edge trigger is enabled for Lines in range 0 to 31.
  * @rmtoll
  *  FTSR1        FTx           LL_EXTI_IsEnabledFallingTrig_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->FTSR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Check if falling edge trigger is enabled for Lines in range 32 to 63.
  * @rmtoll
  *  FTSR2        FTx           LL_EXTI_IsEnabledFallingTrig_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->FTSR2, exti_line) == (exti_line)) ? 1U : 0U);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Software_Interrupt_Management Software_Interrupt_Management
  * @{
  */

/**
  * @brief  Generate a software Interrupt Event for Lines in range 0 to 31.
  * @rmtoll
  *  SWIER1       SWIx          LL_EXTI_GenerateSWI_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note If the interrupt is enabled on this line in the EXTI_IMR, writing a 1 to
  *         this bit sets the corresponding pending bit in EXTI_PR
  *         resulting in an interrupt request generation.
  *         This bit is auto cleared by hardware.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_GenerateSWI_0_31(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->SWIER1, exti_line);
}

/**
  * @brief  Generate a software Interrupt Event for Lines in range 32 to 63.
  * @rmtoll
  *  SWIER2       SWIx          LL_EXTI_GenerateSWI_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note If the interrupt is enabled on this line in the EXTI_IMR2, writing a 1 to
  *         this bit when it is at '0' sets the corresponding pending bit in EXTI_PR2
  *         resulting in an interrupt request generation.
  *         This bit is cleared by clearing the corresponding bit in the EXTI_PR2
  *         register (by writing a 1 into the bit)
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_GenerateSWI_32_63(uint32_t exti_line)
{
  STM32_ATOMIC_SET_BIT_32(EXTI->SWIER2, exti_line);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Flag_Management Flag_Management
  * @{
  */

/**
  * @brief  Check if the EXTI Line Rising Flag is set or not for Lines in range 0 to 31.
  * @rmtoll
  *  RPR1          RPIFx           LL_EXTI_IsActiveRisingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the Rising edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveRisingFlag_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->RPR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the EXTI Line Rising Flag is set or not for Lines in range 32 to 63.
  * @rmtoll
  *  RPR2          RPIFx           LL_EXTI_IsActiveRisingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the Rising edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveRisingFlag_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->RPR2, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Read EXTI Line Combination Rising Flag for Lines in range 0 to 31.
  * @rmtoll
  *  RPR1          RPIFx           LL_EXTI_ReadRisingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the Rising edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @note This bit is set when the selected edge event arrives on the interrupt.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadRisingFlag_0_31(uint32_t exti_line)
{
  return (uint32_t)(STM32_READ_BIT(EXTI->RPR1, exti_line));
}

/**
  * @brief  Read ExtLine Combination Falling Flag for Lines in range 32 to 63.
  * @rmtoll
  *  RPR2          RPIFx           LL_EXTI_ReadRisingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @note This bit is set when the selected edge event arrives on the interrupt.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadRisingFlag_32_63(uint32_t exti_line)
{
  return (uint32_t)(STM32_READ_BIT(EXTI->RPR2, exti_line));
}

/**
  * @brief  Clear EXTI Line Rising Flags for Lines in range 0 to 31.
  * @rmtoll
  *  RPR1          RPIFx           LL_EXTI_ClearRisingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the Rising edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_ClearRisingFlag_0_31(uint32_t exti_line)
{
  STM32_WRITE_REG(EXTI->RPR1, exti_line);
}

/**
  * @brief  Clear EXTI Line Rising Flags for Lines in range 32 to 63.
  * @rmtoll
  *  RPR2          RPIFx           LL_EXTI_ClearRisingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the Rising edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_ClearRisingFlag_32_63(uint32_t exti_line)
{
  STM32_WRITE_REG(EXTI->RPR2, exti_line);
}

/**
  * @brief  Check if the EXTI Line Falling Flag is set or not for Lines in range 0 to 31.
  * @rmtoll
  *  FPR1          FPIFx           LL_EXTI_IsActiveFallingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFallingFlag_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->FPR1, exti_line) == (exti_line)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the EXTI Line Falling Flag is set or not for Lines in range 32 to 63.
  * @rmtoll
  *  FPR2          FPIFx           LL_EXTI_IsActiveFallingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFallingFlag_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->FPR2, exti_line) == (exti_line)) ? 1UL : 0UL);
}

