MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_exti.h
/**
  * @brief  Read EXTI Line Combination Falling Flag for Lines in range 0 to 31.
  * @rmtoll
  *  FPR1          FPIFx           LL_EXTI_ReadFallingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @note This bit is set when the selected edge event arrives on the interrupt.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFallingFlag_0_31(uint32_t exti_line)
{
  return (uint32_t)(STM32_READ_BIT(EXTI->FPR1, exti_line));
}

/**
  * @brief  Read EXTI Line Combination Falling Flag for Lines in range 32 to 63.
  * @rmtoll
  *  FPR2          FPIFx           LL_EXTI_ReadFallingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @note This bit is set when the selected edge event arrives on the interrupt.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFallingFlag_32_63(uint32_t exti_line)
{
  return (uint32_t)(STM32_READ_BIT(EXTI->FPR2, exti_line));
}

/**
  * @brief  Clear EXTI Line Falling Flags for Lines in range 0 to 31.
  * @rmtoll
  *  FPR1          FPIFx           LL_EXTI_ClearFallingFlag_0_31
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_ClearFallingFlag_0_31(uint32_t exti_line)
{
  STM32_WRITE_REG(EXTI->FPR1, exti_line);
}

/**
  * @brief  Clear EXTI Line Falling Flags for Lines in range 32 to 63.
  * @rmtoll
  *  FPR2          FPIFx           LL_EXTI_ClearFallingFlag_32_63
  * @param exti_line This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_34
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @note This bit is set when the falling edge event arrives on the interrupt
  *         line. This bit is cleared by writing a 1 to the bit.
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_ClearFallingFlag_32_63(uint32_t exti_line)
{
  STM32_WRITE_REG(EXTI->FPR2, exti_line);
}

/**
  * @}
  */
/** @defgroup EXTI_LL_EF_Config EF configuration functions
  * @{
  */

/**
  * @brief  Configure source input for the EXTI external interrupt.
  * @rmtoll
  *  EXTI_EXTICR1 EXTI0         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR1 EXTI1         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR1 EXTI2         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR1 EXTI3         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR2 EXTI4         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR2 EXTI5         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR2 EXTI6         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR2 EXTI7         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR3 EXTI8         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR3 EXTI9         LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR3 EXTI10        LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR3 EXTI11        LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR4 EXTI12        LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR4 EXTI13        LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR4 EXTI14        LL_EXTI_SetEXTISource \n
  *  EXTI_EXTICR4 EXTI15        LL_EXTI_SetEXTISource
  * @param port This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_GPIO_PORTA
  *         @arg @ref LL_EXTI_GPIO_PORTB
  *         @arg @ref LL_EXTI_GPIO_PORTC
  *         @arg @ref LL_EXTI_GPIO_PORTD
  *         @arg @ref LL_EXTI_GPIO_PORTE
  * @if GPIOF
  *         @arg @ref LL_EXTI_GPIO_PORTF(*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_EXTI_GPIO_PORTG(*)
  * @endif
  *         @arg @ref LL_EXTI_GPIO_PORTH
  * @if GPIOI
  *         @arg @ref LL_EXTI_GPIO_PORTI(*)
  * @endif
  * @param line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_GPIO_LINE0
  *         @arg @ref LL_EXTI_GPIO_LINE1
  *         @arg @ref LL_EXTI_GPIO_LINE2
  *         @arg @ref LL_EXTI_GPIO_LINE3
  *         @arg @ref LL_EXTI_GPIO_LINE4
  *         @arg @ref LL_EXTI_GPIO_LINE5
  *         @arg @ref LL_EXTI_GPIO_LINE6
  *         @arg @ref LL_EXTI_GPIO_LINE7
  *         @arg @ref LL_EXTI_GPIO_LINE8
  *         @arg @ref LL_EXTI_GPIO_LINE9
  *         @arg @ref LL_EXTI_GPIO_LINE10
  *         @arg @ref LL_EXTI_GPIO_LINE11
  *         @arg @ref LL_EXTI_GPIO_LINE12
  *         @arg @ref LL_EXTI_GPIO_LINE13
  *         @arg @ref LL_EXTI_GPIO_LINE14
  *         @arg @ref LL_EXTI_GPIO_LINE15
  * @note (*)Please check each device gpio port mapping for EXTI gpio port availability.
  */
__STATIC_INLINE void LL_EXTI_SetEXTISource(uint32_t port, uint32_t line)
{
  uint32_t reg_addr = (uint32_t)&EXTI->EXTICR[0] + (line & 0xFU);
  STM32_ATOMIC_MODIFY_REG_8(*(volatile uint8_t *)reg_addr, 0xFU, (uint8_t)port);
}

/**
  * @brief  Get the configured defined for specific EXTI Line.
  * @rmtoll
  *  EXTI_EXTICR1 EXTI0         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR1 EXTI1         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR1 EXTI2         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR1 EXTI3         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR2 EXTI4         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR2 EXTI5         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR2 EXTI6         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR2 EXTI7         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR3 EXTI8         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR3 EXTI9         LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR3 EXTI10        LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR3 EXTI11        LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR4 EXTI12        LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR4 EXTI13        LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR4 EXTI14        LL_EXTI_GetEXTISource \n
  *  EXTI_EXTICR4 EXTI15        LL_EXTI_GetEXTISource
  * @param line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_GPIO_LINE0
  *         @arg @ref LL_EXTI_GPIO_LINE1
  *         @arg @ref LL_EXTI_GPIO_LINE2
  *         @arg @ref LL_EXTI_GPIO_LINE3
  *         @arg @ref LL_EXTI_GPIO_LINE4
  *         @arg @ref LL_EXTI_GPIO_LINE5
  *         @arg @ref LL_EXTI_GPIO_LINE6
  *         @arg @ref LL_EXTI_GPIO_LINE7
  *         @arg @ref LL_EXTI_GPIO_LINE8
  *         @arg @ref LL_EXTI_GPIO_LINE9
  *         @arg @ref LL_EXTI_GPIO_LINE10
  *         @arg @ref LL_EXTI_GPIO_LINE11
  *         @arg @ref LL_EXTI_GPIO_LINE12
  *         @arg @ref LL_EXTI_GPIO_LINE13
  *         @arg @ref LL_EXTI_GPIO_LINE14
  *         @arg @ref LL_EXTI_GPIO_LINE15
  * @note (*)Please check each device gpio port mapping for EXTI gpio port availability.
  * @retval Returned Value can be one of the following values:
  *         @arg @ref LL_EXTI_GPIO_PORTA
  *         @arg @ref LL_EXTI_GPIO_PORTB
  *         @arg @ref LL_EXTI_GPIO_PORTC
  *         @arg @ref LL_EXTI_GPIO_PORTD
  *         @arg @ref LL_EXTI_GPIO_PORTE
  * @if GPIOF
  *         @arg @ref LL_EXTI_GPIO_PORTF(*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_EXTI_GPIO_PORTG(*)
  * @endif
  *         @arg @ref LL_EXTI_GPIO_PORTH
  * @if GPIOI
  *         @arg @ref LL_EXTI_GPIO_PORTI(*)
  * @endif
  */
__STATIC_INLINE uint32_t LL_EXTI_GetEXTISource(uint32_t line)
{
  return ((uint32_t)(STM32_READ_BIT(EXTI->EXTICR[line >> LL_EXTI_CR_REGISTER_SHIFT],
                                    (EXTI_EXTICR1_EXTI0 << ((line & 3U) << 3U)))) >> ((line & 3U) << 3U));
}
/**
  * @}
  */

