MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_exti.h
/** @defgroup EXTI_LL_EF_Privilege_Management Privilege_Management
  * @{
  */

/**
  * @brief  Set the privileged access level attribute for EXTI Lines in range 0 to 31.
  * @rmtoll
  *  PRIVCFGR1    PRIVx         LL_EXTI_SetPrivAttr_0_31
  * @param exti_line This parameter can be one or a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  *         @arg @ref LL_EXTI_LINE_ALL_0_31
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_EXTI_ATTR_PRIV
  *        @arg @ref LL_EXTI_ATTR_NPRIV
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_SetPrivAttr_0_31(uint32_t exti_line, uint32_t priv_attr)
{
  STM32_MODIFY_REG(EXTI->PRIVCFGR1, exti_line, (exti_line & ((~priv_attr) + 1UL)));
}

/**
  * @brief  Set the privileged access level attribute for EXTI Lines in range 32 to 63.
  * @rmtoll
  *  PRIVCFGR2    PRIVx         LL_EXTI_SetPrivAttr_32_63
  * @param exti_line This parameter can be one or a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  *         @arg @ref LL_EXTI_LINE_ALL_32_63
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_EXTI_ATTR_PRIV
  *        @arg @ref LL_EXTI_ATTR_NPRIV
  * @note (*)Please check each device line mapping for EXTI Line availability.
  */
__STATIC_INLINE void LL_EXTI_SetPrivAttr_32_63(uint32_t exti_line, uint32_t priv_attr)
{
  STM32_MODIFY_REG(EXTI->PRIVCFGR2, exti_line, (exti_line & ((~priv_attr) + 1UL)));
}

/**
  * @brief  Get the privileged access level attribute of an EXTI Line in range 0 to 31.
  * @rmtoll
  *  PRIVCFGR1    PRIVx         LL_EXTI_GetPrivAttr_0_31
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_0
  *         @arg @ref LL_EXTI_LINE_1
  *         @arg @ref LL_EXTI_LINE_2
  *         @arg @ref LL_EXTI_LINE_3
  *         @arg @ref LL_EXTI_LINE_4
  *         @arg @ref LL_EXTI_LINE_5
  *         @arg @ref LL_EXTI_LINE_6
  *         @arg @ref LL_EXTI_LINE_7
  *         @arg @ref LL_EXTI_LINE_8
  *         @arg @ref LL_EXTI_LINE_9
  *         @arg @ref LL_EXTI_LINE_10
  *         @arg @ref LL_EXTI_LINE_11
  *         @arg @ref LL_EXTI_LINE_12
  *         @arg @ref LL_EXTI_LINE_13
  *         @arg @ref LL_EXTI_LINE_14
  *         @arg @ref LL_EXTI_LINE_15
  *         @arg @ref LL_EXTI_LINE_16
  *         @arg @ref LL_EXTI_LINE_17
  *         @arg @ref LL_EXTI_LINE_18
  *         @arg @ref LL_EXTI_LINE_19
  *         @arg @ref LL_EXTI_LINE_20
  *         @arg @ref LL_EXTI_LINE_21
  *         @arg @ref LL_EXTI_LINE_22
  *         @arg @ref LL_EXTI_LINE_23
  *         @arg @ref LL_EXTI_LINE_24
  *         @arg @ref LL_EXTI_LINE_25
  *         @arg @ref LL_EXTI_LINE_26
  *         @arg @ref LL_EXTI_LINE_27
  *         @arg @ref LL_EXTI_LINE_28
  *         @arg @ref LL_EXTI_LINE_29
  *         @arg @ref LL_EXTI_LINE_30
  *         @arg @ref LL_EXTI_LINE_31
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval Returned Value can be one of the following values:
  *         @arg @ref LL_EXTI_ATTR_PRIV
  *         @arg @ref LL_EXTI_ATTR_NPRIV
  */
__STATIC_INLINE uint32_t LL_EXTI_GetPrivAttr_0_31(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->PRIVCFGR1, exti_line) == (exti_line)) ? LL_EXTI_ATTR_PRIV : LL_EXTI_ATTR_NPRIV);
}

/**
  * @brief  Get the privileged access level attribute of an EXTI Line in range 32 to 63.
  * @rmtoll
  *  PRIVCFGR2    PRIVx         LL_EXTI_GetPrivAttr_32_63
  * @param exti_line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_32
  *         @arg @ref LL_EXTI_LINE_33
  *         @arg @ref LL_EXTI_LINE_34
  *         @arg @ref LL_EXTI_LINE_35
  * @if EXTI_IMR2_IM36
  *         @arg @ref LL_EXTI_LINE_36(*)
  * @endif
  * @if EXTI_IMR2_IM37
  *         @arg @ref LL_EXTI_LINE_37(*)
  * @endif
  * @if EXTI_IMR2_IM38
  *         @arg @ref LL_EXTI_LINE_38(*)
  * @endif
  * @if EXTI_IMR2_IM39
  *         @arg @ref LL_EXTI_LINE_39(*)
  * @endif
  * @if EXTI_IMR2_IM40
  *         @arg @ref LL_EXTI_LINE_40(*)
  * @endif
  * @if EXTI_IMR2_IM41
  *         @arg @ref LL_EXTI_LINE_41(*)
  * @endif
  * @if EXTI_IMR2_IM42
  *         @arg @ref LL_EXTI_LINE_42(*)
  * @endif
  * @if EXTI_IMR2_IM43
  *         @arg @ref LL_EXTI_LINE_43(*)
  * @endif
  * @note (*)Please check each device line mapping for EXTI Line availability.
  * @retval Returned Value can be one of the following values:
  *         @arg @ref LL_EXTI_ATTR_PRIV
  *         @arg @ref LL_EXTI_ATTR_NPRIV
  */
__STATIC_INLINE uint32_t LL_EXTI_GetPrivAttr_32_63(uint32_t exti_line)
{
  return ((STM32_READ_BIT(EXTI->PRIVCFGR2, exti_line) == (exti_line)) ? LL_EXTI_ATTR_PRIV : LL_EXTI_ATTR_NPRIV);
}

/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */

#endif /* EXTI */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_EXTI_H */
